package com.example.javabasic.tutorial09;

public class Main {
    public static void main(String[] args) {
        System.out.println("객체지향 학습 순서");
    }
}
/* 사용자 정의 함수
* 사용자 정의 함수는 정해진 특정한 기능을 수행하는 모듈을 의미하며 함수를 적절히 활용하면 하나의 문제를 길게 잘게 분해할 수 있습니다.
* 예를 들어 이진 탐색 트리는 삽입, 삭제, 순회 등 다양한 함수의 집합으로 구성됩니다.
* 만약 사용자 정의 함수가 없다면 오직 메인 함수에서 모든 알고리즘을 처리해야 하는데 이는 작업의 효율성을 저하시킬 수 있습니다.
* 또한 함수는 각각의 모듈로써 쉽게 수정되고 보완될 수 있다는 장점이 있습니다.
*  */

/* 객체지향의 꽃 자바!
* 자바 객체지향 프로그래밍
* 먼저 사용자 정의 함수와 배열에 대해서 학습한 다음 자바의 객체 지향 프로그래밍에 대해서 공부합니다.
* 객체 지향 프로그래밍에 익숙할 때 손쉽게 다양한 프로그램을 개발할 수 있게 됩니다.
* 나아가 이후에 다양한 동적 웹 어플리케이션을 구현할 때에도 JSP와 같은 자바 기반의 프로그래밍을 할 수 있습니다.
* 이 때도 객체지향 프로그래밍의 장점을 살린 MVC 모델을 이용한 구축이 이루어집니다.
* 무엇보다 현실세계의 다양한 사물을 컴퓨터 내부의 언어로 표현하고 그것을 활용할 수 있다는 점에서 자바 객체지향 프로그래밍은 아주 활용도가 높은 프로그래밍 기법이라고 할 수 있습니다.
* */

/* 학습 내용
* 사용자 정의 함수: 다양한 사용자 정의 함수를 알아봅니다.
* 반복 함수와 재귀 함수: 반복 함수와 재귀 함수의 차이점을 이해하고 이를 활용합니다.
* 배열: 배열의 기본적인 사용법을 알아봅니다.
* 다차원 배열: 다차원 배열을 정의하여 다양한 문제를 해결합니다.
* 클래스: 클래스의 기본적인 개념을 알아봅니다.
* 상속: 클래스의 상속에 대해서 알아봅니다.
*  */
