package com.example.javabasic.tutorial18;

public class Main {
    public static void main(String[] args) {
        System.out.println("자바 객체지향의 활용");
    }
}
/* 자바 객체지향의 활용
* 자바에서의 객체지향을 본격적으로 활용하기 위해서는 자바의 객체지향 개념을 더욱 더 깊게 이해하고 적용할 필요가 있습니다.
* 자바에서는 C언어나 여타 원시적인 프로그래밍 언어에서는 제공하지 않았던 특수한 기능들을 제공합니다.
* 대표적으로 추상(Abstract) 개념이 있으며 그와 비슷하지만 조금 다른 인터페이스(Interface)의 개념이 존재합니다. 자바에서는 이러한 다양한 설게 기법들을 제공하기 때문에 개발 자체에서의 안정성과 및 확장 가능성을 보장받을 수 있게 됩니다.
* 이러한 다양한 객체 지향 기법의 활용에 대한 내용을 학습합니다.
*  객체지향 : 객체는 일반적으로 말하는 물건을 의미하며 여기서 물건은 단순한 데이터가 아니고 그 데이터의 조작 방법에 대한 정보 또한 포함하고 있어 그것을 대상으로 다루는 수법을 객체지향이라고 합니다.
* */

/* 학습할 순서
* 1. 추상(Aabstract) : 자바에서 추상(Abstract)의 개념에 대하여 학습합니다.
* 2. 최종(Final) : 자바에서 최종(Final)의 쓰임을 알아봅니다.
* 3. 인터페이스(Interface) : 자바에서 인터페이스(Interface)를 활용합니다.
* 4. 다형성(Polymorphism) : 자바에서 다형성(Polymorphism)의 쓰임을 알아봅니다.
* 5. 객체(Object) : 자바에서 객체(Object)의 개념을 바르게 이해합니다.
* 6. 객체지향의 활용 : 자바에서 객체지향을 적절히 활용하는 방법을 이해합니다.
* */